podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/CRC_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "CRC_MKL82Z7" ?>
         <name>CRC</name>
         <description>Cyclic Redundancy Check</description>
         <groupName>CRC</groupName>
         <prependToName>CRC_</prependToName>
         <headerStructName>CRC</headerStructName>
         <baseAddress>0x40032000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DATA</name>
               <description>CRC Data register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>LL</name>
                     <description>CRC Low Lower Byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LU</name>
                     <description>CRC Low Upper Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HL</name>
                     <description>CRC High Lower Byte</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HU</name>
                     <description>CRC High Upper Byte</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCL</name>
               <description>CRC_CRCL register</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0xFFFF</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>CRCL</name>
                     <description>CRCL stores the lower 16 bits of the 16/32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCLL</name>
               <description>CRC_CRCLL register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CRCLL</name>
                     <description>CRCLL stores the first 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCLU</name>
               <description>CRC_CRCLU register</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CRCLU</name>
                     <description>CRCLL stores the second 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCH</name>
               <description>CRC_CRCH register</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0xFFFF</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>CRCH</name>
                     <description>CRCH stores the high 16 bits of the 16/32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCHL</name>
               <description>CRC_CRCHL register</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CRCHL</name>
                     <description>CRCHL stores the third 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCHU</name>
               <description>CRC_CRCHU register</description>
               <addressOffset>0x3</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CRCHU</name>
                     <description>CRCHU stores the fourth 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPOLY</name>
               <description>CRC Polynomial register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x1021</resetValue>
               <fields>
                  <field>
                     <name>LOW</name>
                     <description>Low Polynominal Half-word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>HIGH</name>
                     <description>High Polynominal Half-word</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPOLYL</name>
               <description>CRC_GPOLYL register</description>
               <addressOffset>0x4</addressOffset>
               <size>16</size>
               <resetValue>0xFFFF</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>GPOLYL</name>
                     <description>POLYL stores the lower 16 bits of the 16/32 bit CRC polynomial value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPOLYLL</name>
               <description>CRC_GPOLYLL register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GPOLYLL</name>
                     <description>POLYLL stores the first 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPOLYLU</name>
               <description>CRC_GPOLYLU register</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GPOLYLU</name>
                     <description>POLYLL stores the second 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPOLYH</name>
               <description>CRC_GPOLYH register</description>
               <addressOffset>0x6</addressOffset>
               <size>16</size>
               <resetValue>0xFFFF</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>GPOLYH</name>
                     <description>POLYH stores the high 16 bits of the 16/32 bit CRC polynomial value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPOLYHL</name>
               <description>CRC_GPOLYHL register</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GPOLYHL</name>
                     <description>POLYHL stores the third 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPOLYHU</name>
               <description>CRC_GPOLYHU register</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetValue>0xFF</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GPOLYHU</name>
                     <description>POLYHU stores the fourth 8 bits of the 32 bit CRC</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>CRC Control register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>TCRC</name>
                     <description>Width of CRC protocol</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>16-bit CRC protocol</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit CRC protocol</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAS</name>
                     <description>Write CRC Data Register As Seed</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Writes to the CRC data register are data values</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Writes to the CRC data register are seed values</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FXOR</name>
                     <description>Complement Read Of CRC Data Register</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No XOR on reading</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Invert or complement the read value of the CRC Data register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOTR</name>
                     <description>Type Of Transpose For Read</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>No transposition</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Bits in bytes are transposed; bytes are not transposed</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Both bits in bytes and bytes are transposed</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Only bytes are transposed; no bits in a byte are transposed</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TOTR" > <name>TOT</name> <description>Type Of Transpose For Writes</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>CTRLHU</name>
               <description>CRC_CTRLHU register</description>
               <addressOffset>0xB</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TCRC</name>
                     <description>no description available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>16-bit CRC protocol</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>32-bit CRC protocol</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAS</name>
                     <description>no description available</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Writes to CRC data register are data values</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Writes to CRC data reguster are seed values</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FXOR</name>
                     <description>no description available</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No XOR on reading</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Invert or complement the read value of CRC data register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOTR</name>
                     <description>no description available</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>No Transposition</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Bits in bytes are transposed, bytes are not transposed</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Both bits in bytes and bytes are transposed</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Only bytes are transposed; no bits in a byte are transposed</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TOTR" > <name>TOT</name> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
